app/controllers/reviews_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("comment", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["comment", "Here is the review."], ["created_at", "2019-09-16 15:17:43.864974"], ["updated_at", "2019-09-16 15:17:43.864974"], ["user_id", 1]]
INSERT INTO "reviews" ("comment", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["comment", "wdw"], ["created_at", "2019-09-15 19:27:15.303955"], ["updated_at", "2019-09-15 19:27:15.303955"]]
---
  def create
    @user = User.find(params[:user_id])
    @review = Review.new(review_params)

    if @review.save
      @user.reviews.push(@review)

UPDATE "reviews" SET "comment" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3  [["comment", "Here is a comment."], ["updated_at", "2019-09-16 15:20:13.233330"], ["id", 13]]
---
  def update
    if @review.update(review_params)